# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModuleSettings..::..Dispose Method
ModuleSettings Class See Also
---
Releases all resources used by the ModuleSettings
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
ModuleSettings Class
Autodesk.Revit.DB.Macros Namespace